[
    {
        "name": "Standard",
        "short": "Standard dances, also known as ballroom or smooth dances, are a collection of elegant partner dances characterized by continuous, flowing movements and proper frame, typically including Waltz, Tango, Foxtrot, Viennese Waltz, and Quickstep.",
        "url": "standard",
        "image": "standard/icon.webp"
    },
    {
        "name": "Latin",
        "short": "Latin dances are vibrant, rhythm-focused partner dances characterized by expressive hip movements, syncopated timing, and passionate styling, typically including Cha-Cha, Rumba, Samba, Jive, and Paso Doble.",
        "url": "latin",
        "image": "latin/icon.webp"
    },
    {
        "name": "Breakdance",
        "short": "Breakdance is a dynamic, athletic street dance style featuring acrobatic power moves, complex footwork, and freeze poses, performed solo to hip-hop music with an emphasis on personal expression and competitive showcasing.",
        "url": "breakdance",
        "image": "breakdance/icon.webp"
    },
    {
        "name": "Hip-Hop",
        "short": "Hip-hop is an energetic, freestyle dance style that originated in urban communities, characterized by sharp isolations, rhythmic body movements, and personal expression performed to rap and hip-hop music.",
        "url": "hiphop",
        "image": "hiphop/icon.webp"
    },
    {
        "name": "Waacking",
        "short": "Waacking is a high-energy street dance style that originated in the clubs of 1970s Los Angeles, characterized by fast, rhythmic arm movements, dramatic poses, and expressive performance. It blends elements of disco, funk, and personal storytelling through movement.",
        "url": "waacking",
        "image": "waacking/icon.webp"
    },
    {
        "name": "Swing",
        "short": "Swing is an upbeat, social partner dance that originated in the 1920s-1940s, performed to jazz and big band music. This joyful dance style emphasizes improvisation and connection between partners, making it perfect for social dancing.",
        "url": "swing",
        "image": "swing/icon.webp"
    },
    {
        "name": "Jazz Funk",
        "short": "Jazz funk is a high-energy dance style that combines jazz technique with funk music's groove and attitude, featuring sharp isolations and dynamic choreography. This expressive style emphasizes musicality and personal flair, making it popular in commercial dance settings.",
        "url": "jazz-funk",
        "image": "jazz-funk/icon.webp"
    },
    {
        "name": "Heels",
        "short": "Heels dance is an empowering dance style performed in high heels that combines jazz, contemporary, and commercial elements with fierce attitude. This expressive art form celebrates confidence and femininity through dynamic choreography emphasizing floor work and sharp isolations.",
        "url": "heels",
        "image": "heels/icon.webp"
    },
    {
        "name": "Modern",
        "short": "Modern dance is a broad, expressive dance style that emerged in the early 20th century as a rebellion against classical ballet, emphasizing natural movement, emotional expression, and individual creativity. It often incorporates floor work, improvisation, and innovative choreography.",
        "url": "modern",
        "image": "modern/icon.webp"
    },
    {
        "name": "Musical",
        "short": "Musical dance, often seen in musical theatre, combines expressive dance with storytelling, acting, and song to enhance the narrative of a performance. It blends various dance styles—such as jazz, ballet, and tap—to match the mood and theme of the musical.",
        "url": "musical",
        "image": "musical/icon.webp"
    },
    {
        "name": "Afro",
        "short": "Afro dance is a vibrant and energetic style rooted in various African dance traditions, characterized by rhythmic movements, expressive footwork, and a strong connection to the beat. It often fuses traditional African steps with contemporary influences like hip-hop and dancehall.",
        "url": "afro",
        "image": "afro/icon.webp"
    },
    {
        "name": "Yoga",
        "short": "Yoga is an ancient practice combining physical postures, breathing techniques, and mindfulness to improve flexibility, strength, and mental well-being. This holistic discipline promotes balance between body and mind, making it suitable for all fitness levels and ages.",
        "url": "yoga",
        "image": "yoga/icon.webp"
    },
    {
        "name": "Stretching",
        "short": "Stretching is a guided movement practice focused on improving flexibility, releasing muscle tension, and enhancing overall body mobility. It involves gentle, sustained poses that promote relaxation and physical well-being.",
        "url": "stretching",
        "image": "stretching/icon.webp"
    },
    {
        "name": "Personal Training",
        "short": "Personal training is a customized fitness program guided by a certified trainer, designed to help individuals achieve specific health and workout goals. It combines exercise instruction, motivation, and expert support tailored to each person's needs and abilities.",
        "url": "personal-training",
        "image": "personal-training/icon.webp"
    }
]
